#+SETUPFILE: .orgconfig
#+NAME: setup
#+BEGIN_SRC emacs-lisp :results silent
  (require 'emir)

  (defun emir--save-variable (variable value)
    (customize-save-variable variable (and (not (equal value "nil")) value))
    nil)
#+END_SRC
[[https://emacsmirror.net/stats][up]]
* Package variables
** variable ~emir-emacs-repository~
#+NAME: set--emir-emacs-repository
#+BEGIN_SRC emacs-lisp :results silent
  (emir--save-variable 'emir-emacs-repository "~/Repos/emacs/25.1/")
#+END_SRC

** variable ~emir-reports-directory~
#+NAME: set--emir-reports-directory
#+BEGIN_SRC emacs-lisp :results silent
  (emir--save-variable 'emir-reports-directory
                       "~/code/emacsmirror/export/reports/")
#+END_SRC

** variable ~emir-pending-packages~
#+NAME: set--emir-pending-packages
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-pending-packages
  (emir--save-variable 'emir-pending-packages value)
#+END_SRC
#+NAME: emir-pending-packages
| Package | Reason |
|---------+--------|

** variable ~emir-secondary-packages~
#+NAME: set--emir-secondary-packages
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-secondary-packages
  (emir--save-variable 'emir-secondary-packages value)
#+END_SRC
#+NAME: emir-secondary-packages
| Secondary    | Primary |
|--------------+---------|
| ccc          | ddskk   |
| cdb          | ddskk   |
| shimbun      | w3m     |
| sml-modeline | nxhtml  |

** variable ~emir-suspended-packages~
#+NAME: set--emir-suspended-packages
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-suspended-packages
  (emir--save-variable 'emir-suspended-packages value)
#+END_SRC
#+NAME: emir-suspended-packages
| Package | Reason |
|---------+--------|

** variable ~emir-renamed-files~
#+NAME: set--emir-renamed-files
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-renamed-files
  (emir--save-variable 'emir-renamed-files value)
#+END_SRC
#+NAME: emir-renamed-files
| Name                  | Filename                                     |
|-----------------------+----------------------------------------------|
| chasen                | chasen.el.txt                                |
| debian-bug            | debian-bug.el?root=pkg-goodies-el            |
| debian-changelog-mode | debian-changelog-mode.el?root=pkg-goodies-el |
| japanese-tokenizer    | japanese-tokenizer.el.txt                    |
| llvm-mode             | llvm-mode.el?view=co                         |
| spamfilter            | spamfilter.el.txt                            |
| tablegen-mode         | tablegen-mode.el?view=co                     |

** variable ~emir-preferred-upstreams~
#+NAME: set--emir-preferred-upstreams
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-preferred-upstreams
  (emir--save-variable 'emir-preferred-upstreams value)
#+END_SRC
#+NAME: emir-preferred-upstreams
| Name               | Reason               |
|--------------------+----------------------|
| ace-window         | squash               |
| ack                | [[https://github.com/leoliu/sokoban/issues/2][leoliu/sokoban#2]]     |
| ada-mode           | builtin              |
| aggressive-indent  | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| async              | squash               |
| avy                | squash               |
| auctex             | actively maintained  |
| beacon             | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| bug-hunter         | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| cedet              | not [[http://git.randomsample.de/cedet.git][randomsample.de]]  |
| coffee-mode        | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67443674][#34#67443674]]         |
| company            | squash [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67203059][#34#67203059]]  |
| company-math       | squash [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164841865][#69#164841865]] |
| company-statistics | squash               |
| crisp              | builtin              |
| dash               | external             |
| dbus-codegen       | squash               |
| diff-hl            | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67203059][#34#67203059]]         |
| dts-mode           | [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164455502][#69#164455502]]        |
| easy-kill          | [[https://github.com/milkypostman/melpa/issues/3383#issuecomment-164356304][melpa#3383#164356304]] |
| eldoc-eval         | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67275846][#34#67275846]]         |
| electric-spacing   | [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164462609][#69#164462609]]        |
| ergoemacs-mode     | [[https://github.com/milkypostman/melpa/issues/3383#issuecomment-164897071][melpa#3383#164897071]] |
| exwm               | external             |
| f90-face           | [[https://github.com/wence-/f90-iface/issues/1][wence-/f90-iface#1]]   |
| ggtags             | [[https://github.com/leoliu/sokoban/issues/2][leoliu/sokoban#2]]     |
| gnorb              | squash               |
| gnus               | not [[http://git.gnus.org/gnus.git][gnus.org]]         |
| hydra              | squash               |
| ioccur             | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67275846][#34#67275846]]         |
| ivy                | squash               |
| js2-mode           | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67203059][#34#67203059]]         |
| load-relative      |                      |
| loc-changes        | [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164446621][#69#164446621]]        |
| loccur             | squash               |
| math-symbol-lists  | squash [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164841865][#69#164841865]] |
| minimap            | unfriendly fork      |
| nameless           | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| names              | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| on-screen          | [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164450677][#69#164450677]]        |
| pabbrev            | [[https://github.com/milkypostman/melpa/issues/3383#issuecomment-164418230][melpa#3383#164418230]] |
| rich-minority      | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| sokoban            | [[https://github.com/leoliu/sokoban/issues/2][leoliu/sokoban#2]]     |
| sotlisp            | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| spinner            | [[https://github.com/milkypostman/melpa/issues/3383][melpa#3383]]           |
| test-simple        | [[https://github.com/emacsmirror/p.old/issues/69#issuecomment-164446621][#69#164446621]]        |
| tiny               | squash               |
| undo-tree          | squash               |
| vlf                | [[https://github.com/milkypostman/melpa/issues/3383#issuecomment-164299250][melpa#3383#164299250]] |
| wcheck-mode        | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-68142129][#34#68142129]]         |
| websocket          | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-68123453][#34#68123453]]         |
| web-server         | [[https://github.com/milkypostman/melpa/pull/3394][melpa#3394]]           |
| xelb               | external             |
| yasnippet          | [[https://github.com/emacsmirror/p.old/issues/34#issuecomment-67199311][#34#67199311]]         |
| ztree              | [[https://github.com/milkypostman/melpa/issues/3383#issuecomment-164285940][melpa#3383#164285940]] |

** variable ~emir-orphanage-reason~
#+NAME: set--emir-orphanage-reason
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-orphanage-reason
  (emir--save-variable 'emir-orphanage-reason value)
#+END_SRC
#+NAME: emir-orphanage-reason
| Package          | Reason                      |
|------------------+-----------------------------|
| apel             | 6. many feature conflicts   |
| caml             | 5. svn not supported        |
| cg               | 5. svn not supported        |
| clang-format     | 5. svn not supported        |
| color-theme      | 5. bzr not supported        |
| confluence       | 5. svn not supported        |
| crontab-mode     | 3. upstream disappeared     |
| darcsum          | 5. darcs not supported      |
| dedicated        | 2. upstream has disappeared |
| dic-lookup-w3m   | 5. svn not supported        |
| doom             | 3. upstream unresponsive    |
| ecasound         | 3. upstream disappeared     |
| elisp-depend     | 3. upstream unresponsive    |
| elo              | 4. dropped of by maintainer |
| eshell-manual    | 3. upstream unresponsive    |
| filladapt        | 3. upstream unresponsive    |
| flim             | 6. many feature conflicts   |
| helm-ls-svn      | 5. svn not supported        |
| keydef           | 2. upstream disappeared     |
| linkd            | 7. include the images       |
| lively           | 3. upstream unresponsive    |
| lsdb             | 5. tarball not supported    |
| magit-filenotify | [[https://github.com/emacsorphanage/magit-filenotify/issues/19][#19]]                         |
| miniedit         | 2. upstream disappeared     |
| nxhtml           | 5. bzr not supported        |
| oberon           | 3. upstream unresponsive    |
| org-bullets      | [[https://github.com/sabof/org-bullets/issues/18][#18]]                         |
| org-grep         | 1. the maintainer has died  |
| osd              | 2. upstream disappeared     |
| pager            | 2. upstream disappeared     |
| picolisp         | 8. should contact upstream  |
| pointback        | 2. upstream disappeared     |
| read-char-spec   | 3. upstream unresponsive    |
| ruby-additional  | 5. svn not supported        |
| semi             | 6. many feature conflicts   |
| session          | 5. tarball not supported    |
| setnu            | 3. upstream unresponsive    |
| smarty-mode      | 2. upstream has disappeared |
| swbuff           | 5. cvs not supported        |
| tail             | 2. upstream has disappeared |
| text-translator  | 5. bzr not supported        |
| vala-mode        | 2. upstream has disappeared |
| vc-fossil        | 5. fossil not supported     |
| vm               | 5. bzr not supported        |
| w3m              | 5. cvs not supported        |
| wanderlust       | 6. many feature conflicts   |

** variable ~emir-library-reason~
#+NAME: set--emir-library-reason
#+BEGIN_SRC emacs-lisp :results silent :var value=emir-library-reason
  (emir--save-variable 'emir-library-reason value)
#+END_SRC
#+NAME: emir-library-reason
| Package               | Reason                                  |
|-----------------------+-----------------------------------------|
| autotest              | unrelated in one git repo [[https://github.com/zenspider/elisp/issues/5][#5]] (rejected) |
| caml                  | svn                                     |
| cfengine-code-style   | mostly non-elisp                        |
| cg                    | svn                                     |
| clang-format          | svn                                     |
| cmake-mode            | mostly non-elisp                        |
| color-theme           | bzr                                     |
| confluence            | svn                                     |
| cython-mode           | mostly non-elisp                        |
| darcsum               | darcs [[https://github.com/emacsorphanage/darcsum/commit/e6d8b3b07fa2145210520861cf7f7062bfc6feb9][e6d8b3b]]                           |
| debian-bug            | mostly non-elisp                        |
| debian-changelog-mode | mostly non-elisp                        |
| dic-lookup-w3m        | svn                                     |
| dsvn                  | svn                                     |
| google-c-style        | mostly non-elisp                        |
| helm-ls-svn           | svn                                     |
| llvm-mode             | mostly non-elisp                        |
| nemerle               | mostly non-elisp                        |
| ninja-mode            | mostly non-elisp                        |
| ox-clip               | unrelated in one git repo [[https://github.com/jkitchin/scimax/issues/21][#21]] (pending) |
| po-mode               | mostly non-elisp                        |
| pylint                | mostly non-elisp                        |
| ruby-additional       | svn                                     |
| ruby-electric         | svn                                     |
| tex-smart-umlauts     | darcs                                   |
| thrift                | mostly non-elisp                        |
| toggle                | unrelated in one git repo [[https://github.com/zenspider/elisp/issues/5][#5]] (rejected) |
| w3m                   | cvs [[https://github.com/melpa/melpa/pull/3378#issuecomment-221855624][melpa#3378]]                          |
| wisp-mode             | mostly non-elisp                        |

* Rare slots
** slot ~upstream-branch~
#+NAME: slot--upstream-branch
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Branch")
    (epkg-sql [:select [name class upstream-branch] :from packages
               :where (notnull upstream-branch)
               :and class :in $v1
               :order-by [(asc name)]]
              (closql--where-class-in
               (epkg-db)
               'epkg-mirrored-package--eieio-childp)))
#+END_SRC
#+RESULTS: slot--upstream-branch
| Package             | Type   | Branch      |
|---------------------+--------+-------------|
| distinguished-theme | github | develop     |
| ebuild-mode         | git    | ebuild-mode |

** slot ~library~

Unlike for mirrored packages, this slot is set to an automatically
determined value for all builtin packages (except the pseudo-package
~emacs~), so these packages are not listed here.

An exception to the exception is the builtin package ~nxml~.  Its
~library~ was set explictily.  There is no ~nxml.el~ library, only
~nxml-mode.el~, so this departure from the conventions had to be
explicitly sanctioned by setting the value of ~library~ explicitly.
But being an exception to the exception, this cannot automatically
be listed here.  Thus this comment.

#+NAME: slot--library
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Library")
    (epkg-sql [:select [name class library] :from packages
               :where (notnull library)
               :and class :in $v1
               :order-by [(asc name)]]
              (closql--where-class-in
               (epkg-db)
               'epkg-mirrored-package--eieio-childp)))
#+END_SRC
#+RESULTS: slot--library
| Package              | Type        | Library                 |
|----------------------+-------------+-------------------------|
| ada-ref-man          | elpa        | ada-ref-man.el          |
| auctex               | elpa-branch | tex.el                  |
| ca2                  | github      | ca2+.el                 |
| chumpy-windows       | github      | window-jump.el          |
| ddskk                | github      | skk.el                  |
| dired-hacks          | github      | dired-hacks-utils.el    |
| emacs-speaks-nonmem  | github      | esn-start.el            |
| emux                 | github      | emux-base.el            |
| ert-runner           | github      | ert-runner.el           |
| eziam-theme          | github      | eziam-dark-theme.el     |
| farmhouse-theme      | github      | farmhouse-dark-theme.el |
| gh                   | github      | gh-api.el               |
| html5                | github      | html5-ncr.el            |
| literate-starter-kit | github      | init.el                 |
| majapahit-theme      | gitlab      | majapahit-dark-theme.el |
| meacupla-theme       | gitlab      | meacupla-theme.el       |
| ne2wm                | github      | ne2wm-setup.el          |
| punpun-theme         | github      | punpun-dark-theme.el    |
| spacemacs-theme      | github      | spacemacs-dark-theme.el |
| suscolors-theme      | github      | suscolors-theme.el      |
| tao-theme            | github      | tao-yang-theme.el       |
| ultratex             | github      | lisp/ultex.el           |
| uni-confusables      | elpa        | uni-confusables.el      |
| zotxt                | gitlab      | zotxt.el                |

** slot ~libraries~
#+NAME: slot--libraries
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Library")
    (epkg-sql [:select [name class libraries:library]
               :from [packages libraries]
               :where (= name package)
               :and class :in $v1
               :order-by [(asc package)
                          (asc libraries:library)]]
              (closql--where-class-in
               (epkg-db)
               'epkg-mirrored-package--eieio-childp)))
#+END_SRC
#+RESULTS: slot--libraries
| Package            | Type | Library                      |
|--------------------+------+------------------------------|
| bookmark+          | wiki | bookmark+-1.el               |
| bookmark+          | wiki | bookmark+-bmu.el             |
| bookmark+          | wiki | bookmark+-chg.el             |
| bookmark+          | wiki | bookmark+-doc.el             |
| bookmark+          | wiki | bookmark+-key.el             |
| bookmark+          | wiki | bookmark+-lit.el             |
| bookmark+          | wiki | bookmark+-mac.el             |
| bookmark+          | wiki | bookmark+.el                 |
| d-insert-import    | wiki | d-insert-import-data.el      |
| d-insert-import    | wiki | d-insert-import.el           |
| icicles            | wiki | icicles-chg.el               |
| icicles            | wiki | icicles-cmd1.el              |
| icicles            | wiki | icicles-cmd2.el              |
| icicles            | wiki | icicles-doc1.el              |
| icicles            | wiki | icicles-doc2.el              |
| icicles            | wiki | icicles-face.el              |
| icicles            | wiki | icicles-fn.el                |
| icicles            | wiki | icicles-mac.el               |
| icicles            | wiki | icicles-mcmd.el              |
| icicles            | wiki | icicles-mode.el              |
| icicles            | wiki | icicles-opt.el               |
| icicles            | wiki | icicles-var.el               |
| icicles            | wiki | icicles.el                   |
| mkhtml             | wiki | mkhtml-htmlize.el            |
| mkhtml             | wiki | mkhtml.el                    |
| sequential-command | wiki | sequential-command-config.el |
| sequential-command | wiki | sequential-command.el        |
| thing-edit         | wiki | thing-edit-extension.el      |
| thing-edit         | wiki | thing-edit.el                |
| yaoddmuse          | wiki | yaoddmuse-extension.el       |
| yaoddmuse          | wiki | yaoddmuse.el                 |

* Auxiliary tables
** table ~pkg-homepages~
#+NAME: table--pkg-homepages
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Homepage")
    (epkg-sql [:select * :from pkg-homepages :order-by [(asc package)]]))
#+END_SRC
#+RESULTS: table--pkg-homepages
| Package                   | Homepage                                                                     |
|---------------------------+------------------------------------------------------------------------------|
| active-menu               | [[http://www.skamphausen.de/cgi-bin/ska/Software]]                               |
| adv-random-sig            | [[http://www.zonix.de/projects/emacs/lisp]]                                      |
| agchat                    | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| archie                    | [[http://quimby.gnus.org/elisp]]                                                 |
| auto-show-doc             | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| autocap                   | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| banner                    | [[http://www.cb1.com/~john/computing/emacs/lisp/misc]]                           |
| bar-cursor                | [[http://www.northbound-train.com]]                                              |
| bash-org                  | [[http://edward.oconnor.cx/elisp]]                                               |
| bbdb                      | [[http://bbdb.sourceforge.net]]                                                  |
| bbdb-pilot-jwz            | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| binclock                  | [[http://www.davep.org/emacs]]                                                   |
| blackbook                 | [[http://fly.srk.fer.hr/~hniksic]]                                               |
| breadcrumb                | [[http://breadcrumbemacs.sourceforge.net]]                                       |
| breathe                   | [[http://www.cb1.com/~john/computing/emacs/lisp/well-being]]                     |
| brief                     | [[http://www.emacs.mirkolinkonline.de/spiele.html]]                              |
| buffer-fns                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| bytecomp-fns              | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| c-comment-edit            | [[http://www.wonderworks.com]]                                                   |
| cc-tempo-electric-support | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| cif                       | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| cldoc                     | [[http://homepage1.nifty.com/bmonkey/emacs/index-en.html]]                       |
| cmucl-wire                | [[http://emarsden.chez.com/downloads]]                                           |
| cocol                     | [[http://lgarc.narod.ru/xemacs]]                                                 |
| coffee                    | [[http://emarsden.chez.com/downloads]]                                           |
| comint-popup              | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| completing-help           | [[http://homepage1.nifty.com/bmonkey/emacs/index-en.html]]                       |
| constants                 | [[http://staff.science.uva.nl/~dominik/Tools/constants]]                         |
| constellations            | [[http://www.davep.org/emacs]]                                                   |
| copy-directory            | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| couchdb                   | [[http://edward.oconnor.cx/elisp]]                                               |
| csv                       | [[http://ulf.epplejasper.de/EmacsGeneralPurpose.html]]                           |
| csv-vocab-mode            | [[http://www.cb1.com/~john/computing/emacs/lisp/natural-language]]               |
| csv-writer                | [[http://www.cb1.com/~john/computing/emacs/lisp/data-structures]]                |
| cua-lite                  | [[http://www.northbound-train.com]]                                              |
| cua-lite-bootstrap        | [[http://www.northbound-train.com]]                                              |
| cvs-scramble              | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| cygwin-link               | [[http://edward.oconnor.cx/elisp]]                                               |
| czscm                     | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| dar                       | [[http://www.xsteve.at/prg/emacs/dar]]                                           |
| dbfrobs                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| deep-copy                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| delatex                   | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| diacriticalize            | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| diary-outlook             | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| dict-web                  | [[http://emarsden.chez.com/downloads]]                                           |
| dictem                    | [[http://sourceforge.net/projects/dictem]]                                       |
| dictionary                | [[http://www.myrkr.in-berlin.de/dictionary/index.html]]                          |
| dir-shell                 | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| disptime                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| dms-sig                   | [[http://thesassers.com/dewey/DmsSig.html]]                                      |
| doh                       | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| dvi-view                  | [[http://www.cb1.com/~john/computing/emacs/lisp/graphics]]                       |
| dwim-find                 | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| ediprolog                 | [[http://www.logic.at/prolog/ediprolog/ediprolog.html]]                          |
| edit-tree                 | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| em-joc                    | [[http://www.northbound-train.com]]                                              |
| emacs-name                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| emacs-variants            | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| emacs-wiki-boxes          | [[http://sugarshark.com/ProjectPage.html]]                                       |
| emms                      | [[http://www.gnu.org/software/emms]]                                             |
| erc-track-score           | [[https://julien.danjou.info/projects/emacs-packages#erc-track-score]]           |
| escreen                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ess                       | [[http://ess.r-project.org]]                                                     |
| etest                     | [[http://www.shellarchive.co.uk/content/etest.html]]                             |
| eval-expr                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| face-fns                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ff-paths                  | [[http://people.debian.org/~psg/elisp]]                                          |
| fff                       | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| fff-elisp                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| fff-rfc                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| file-confirm              | [[http://www.iki.fi/pema/emacs]]                                                 |
| file-ext                  | [[http://www.emacs.mirkolinkonline.de/extras.html]]                              |
| file-fns                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| filename-cases            | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| filenames-in-env          | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| find-commands             | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| find-empty-el-files       | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| find-file-suggest         | [[http://code.google.com/p/find-file-suggest]]                                   |
| flame                     | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| flash-paren               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| flatten-saved-pages       | [[http://www.cb1.com/~john/computing/emacs/lisp/webstuff]]                       |
| flyspell-textcat          | [[http://os.inf.tu-dresden.de/~mp26/emacs.shtml]]                                |
| flyspell-timer            | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| fm                        | [[http://www.anc.ed.ac.uk/~stephen/emacs]]                                       |
| fmailutils                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| fscroll                   | [[http://www.davep.org/emacs]]                                                   |
| fshell                    | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ftcp                      | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ftelnet                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| garble                    | [[http://www.davep.org/emacs]]                                                   |
| gedcom                    | [[http://www.rempe-online.de/genealogie/lines]]                                  |
| geek                      | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| geiser                    | [[http://www.nongnu.org/geiser]]                                                 |
| gentext-bindings          | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| gentext-models            | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| gnus-checker              | [[http://www.shellarchive.co.uk/content/emacs.html]]                             |
| gnus-highlight            | [[http://www.hardakers.net/elisp]]                                               |
| google                    | [[http://edward.oconnor.cx/elisp]]                                               |
| google-contacts           | [[https://julien.danjou.info/projects/emacs-packages#google-contacts]]           |
| google-maps               | [[https://julien.danjou.info/projects/emacs-packages#google-maps]]               |
| goto-char-other-window    | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| grabbox                   | [[http://www.xsteve.at/prg/emacs]]                                               |
| gresreg                   | [[http://www.bookshelf.jp]]                                                      |
| growl                     | [[http://edward.oconnor.cx/elisp]]                                               |
| highlight-context-line    | [[http://www.skamphausen.de/cgi-bin/ska/highlight-context-line]]                 |
| himarks-mode              | [[http://lgarc.narod.ru/xemacs]]                                                 |
| hl-sexp                   | [[http://edward.oconnor.cx/elisp]]                                               |
| hobo                      | [[http://www.northbound-train.com]]                                              |
| horoscope                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| host-fns                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| html-chooser-mode         | [[http://www.dur.ac.uk/p.j.heslin/Software/Emacs]]                               |
| html-phrase-list          | [[http://www.cb1.com/~john/computing/emacs/lisp/natural-language]]               |
| html-toc                  | [[http://www.pvv.org/~rolfn]]                                                    |
| html5                     | [[http://edward.oconnor.cx/elisp]]                                               |
| hyde                      | [[http://nibrahim.net.in/2010/11/11/hyde_:_an_emacs_mode_for_jekyll_blogs.html]] |
| hyphenate                 | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| ibs                       | [[http://www.geekware.de/software/emacs]]                                        |
| icmp-info                 | [[http://www.davep.org/emacs]]                                                   |
| iman                      | [[http://homepage1.nifty.com/bmonkey/emacs]]                                     |
| indent-tabs-maybe         | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| info-apropos              | [[http://www.phys.au.dk/~harder]]                                                |
| infobook                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| inktc                     | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| insert-construct          | [[http://www.cb1.com/~john/computing/emacs/lisp/handsfree]]                      |
| insertions                | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| install                   | [[http://www.iro.umontreal.ca/~monnier/elisp]]                                   |
| invoice                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ion3                      | [[http://www.xsteve.at/prg/emacs]]                                               |
| ipp                       | [[http://emarsden.chez.com/downloads]]                                           |
| iuscheme                  | [[http://www.cs.indiana.edu/chezscheme/emacs]]                                   |
| java-find                 | [[http://www.northbound-train.com]]                                              |
| jfolding                  | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| journal-search            | [[http://www.cb1.com/~john/computing/emacs/lisp/webstuff]]                       |
| joystick                  | [[http://www.cb1.com/~john/computing/emacs/lisp/hardware]]                       |
| jpeg-mode                 | [[http://www.cb1.com/~john/computing/emacs/lisp/graphics]]                       |
| js-doctor                 | [[http://www.cb1.com/~john/computing/emacs/lisp/email]]                          |
| kbd-fns                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| keymap-hacks              | [[http://www.cb1.com/~john/computing/emacs/lisp/misc]]                           |
| keywiz                    | [[http://www.phys.au.dk/~harder]]                                                |
| kibologize                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| kill-a-lawyer             | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| labbook                   | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| lat1conv                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| lazy-desktop              | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| lbdb                      | [[http://www.davep.org/emacs]]                                                   |
| ldif-ns                   | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| lessage                   | [[http://www.cb1.com/~john/computing/emacs/lisp/misc]]                           |
| linuxproc                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| list-fns                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| list-register             | [[http://www.bookshelf.jp]]                                                      |
| listbuf                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| lmselect                  | [[http://edward.oconnor.cx/elisp]]                                               |
| load-fns                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| localized-source          | [[http://www.cb1.com/~john/computing/emacs/lisp/natural-language]]               |
| lookout                   | [[http://ulf.epplejasper.de/EmacsCalendarAndDiary.html]]                         |
| loop-constructs           | [[http://gmarceau.qc.ca]]                                                        |
| lude                      | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| mail-directory            | [[http://www.cb1.com/~john/computing/emacs/lisp/email]]                          |
| mailrc-mode               | [[http://www.cb1.com/~john/computing/emacs/lisp/email]]                          |
| mallow                    | [[http://edward.oconnor.cx/elisp]]                                               |
| malyon                    | [[http://www.ifarchive.org]]                                                     |
| manued                    | [[http://www.mpi-inf.mpg.de/~hitoshi/otherprojects/manued/index.shtml]]          |
| map-win                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| mcomplete                 | [[http://homepage1.nifty.com/bmonkey/emacs/index-en.html]]                       |
| meditate                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| mew                       | [[http://www.mew.org]]                                                           |
| mhc                       | [[http://www.quickhack.net/mhc]]                                                 |
| mic-paren                 | [[http://www.gnuvola.org/software/j/mic-paren]]                                  |
| misc-elisp-tools          | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| mk-project                | [[http://www.littleredbat.net/mk/code/mk-project.html]]                          |
| moccur-edit               | [[http://www.bookshelf.jp]]                                                      |
| moo                       | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| motion-fns                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| mouse-embrace             | [[http://www.xsteve.at/prg/emacs]]                                               |
| mouse-focus               | [[http://www.skamphausen.de/cgi-bin/ska/mouse-focus]]                            |
| mpg123                    | [[http://www.gentei.org/~yuuji/software/mpg123el]]                               |
| multi-find-file           | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| multiselect               | [[http://www.skamphausen.de/cgi-bin/ska/multiselect]]                            |
| multr                     | [[http://lgarc.narod.ru/xemacs]]                                                 |
| muse-blog                 | [[https://julien.danjou.info/projects/emacs-packages#muse-blog]]                 |
| muse-definition           | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| muse-settings             | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| muse-trail                | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| mutt-alias                | [[http://www.davep.org/emacs]]                                                   |
| mwe-cambridge-permute     | [[http://www.foldr.org/~michaelw/emacs]]                                         |
| mwe-color-box             | [[http://www.foldr.org/~michaelw/emacs]]                                         |
| mwe-log-commands          | [[http://www.foldr.org/~michaelw/emacs]]                                         |
| netrexx-mode              | [[http://zaaf.nl/emacs/emacs.html]]                                              |
| nf-procmail-mode          | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ngn                       | [[http://www.davep.org/emacs]]                                                   |
| notes-mode                | [[http://www.isi.edu/~johnh/SOFTWARE/NOTES_MODE/index.html]]                     |
| ns-browse                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| nukneval                  | [[http://www.davep.org/emacs]]                                                   |
| obarray-fns               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| obfusurl                  | [[http://www.davep.org/emacs]]                                                   |
| objc-c-mode               | [[http://www.foldr.org/~michaelw/objective-c/index.html#objc-mode]]              |
| octal-chars               | [[http://www.cb1.com/~john/computing/emacs/lisp/natural-language]]               |
| odf-mode                  | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| offlineimap               | [[https://julien.danjou.info/projects/emacs-packages#offlineimap]]               |
| order-head                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| org-daypage               | [[http://almostobsolete.net/daypage.html]]                                       |
| osx-plist                 | [[http://edward.oconnor.cx/elisp]]                                               |
| pack-windows              | [[http://lampwww.epfl.ch/~schinz/elisp]]                                         |
| pb-popup                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| pdb                       | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| pgg-crypt                 | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| phrase                    | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| pick-backup               | [[http://nschum.de/src/emacs/pick-backup]]                                       |
| plugin                    | [[http://gmarceau.qc.ca]]                                                        |
| pom                       | [[http://sugarshark.com/ProjectPage.html]]                                       |
| prefixkey                 | [[http://lgarc.narod.ru/xemacs]]                                                 |
| proc-filters              | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| progr-align               | [[http://www.xsteve.at/prg/emacs]]                                               |
| project-buffer-mode       | [[http://repo.or.cz/w/project-buffer-mode.git]]                                  |
| protbuf                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| protocols                 | [[http://www.davep.org/emacs]]                                                   |
| prove                     | [[http://www.shellarchive.co.uk/content/emacs.html]]                             |
| ps-stack-comments         | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| pseudo-grep               | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| psvn                      | [[http://www.xsteve.at/prg/vc_svn]]                                              |
| pwsafe                    | [[http://www.xsteve.at/prg/emacs]]                                               |
| pylookup                  | [[http://taesoo.org/Opensource/Pylookup]]                                        |
| qemu                      | [[http://racin.free.fr]]                                                         |
| qpdecode                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| quack                     | [[http://www.neilvandyke.org/quack]]                                             |
| quick-task                | [[http://www.xsteve.at/prg/emacs]]                                               |
| randomsig                 | [[http://www.backmes.de/scripts+programs.html]]                                  |
| rdict                     | [[http://lgarc.narod.ru/xemacs]]                                                 |
| read-all-emacs-help       | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| recent                    | [[http://levana.de/emacs]]                                                       |
| record                    | [[http://gmarceau.qc.ca]]                                                        |
| redo                      | [[http://www.wonderworks.com]]                                                   |
| redshank                  | [[http://www.foldr.org/~michaelw/emacs/redshank]]                                |
| regression                | [[http://www.cb1.com/~john/computing/emacs/lisp/misc]]                           |
| removable-media           | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| revive                    | [[http://www.gentei.org/~yuuji/software]]                                        |
| riece                     | [[http://www.nongnu.org/riece]]                                                  |
| rijndael                  | [[http://josefsson.org/aes]]                                                     |
| rmail-frobs               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| rpn-edit                  | [[http://www.cb1.com/~john/computing/emacs/lisp/handsfree]]                      |
| save-undo                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| saveframes                | [[http://www.iki.fi/pema/emacs]]                                                 |
| scrape                    | [[http://edward.oconnor.cx/elisp]]                                               |
| screen-lines              | [[http://homepage1.nifty.com/bmonkey/emacs/index-en.html]]                       |
| sendmail-alias            | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| services                  | [[http://www.davep.org/emacs]]                                                   |
| setq-trap                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| shop                      | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| show-functions            | [[http://aurelien.tisne.free.fr/emacs-pages/emacs.html]]                         |
| silly-mail                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| skip-initial-comments     | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| slashdot                  | [[http://www.davep.org/emacs]]                                                   |
| smallurl                  | [[http://www.shellarchive.co.uk/content/emacs.html]]                             |
| smartsig                  | [[http://www.davep.org/emacs]]                                                   |
| soap                      | [[http://edward.oconnor.cx/elisp]]                                               |
| spamprobe                 | [[http://www.davep.org/emacs]]                                                   |
| speechd                   | [[http://www.freebsoft.org/speechd-el]]                                          |
| split-root                | [[http://nschum.de/src/emacs/split-root]]                                        |
| split-window-multi        | [[http://www.cb1.com/~john/computing/emacs/lisp/appearance]]                     |
| spookmime                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| sqlplus-html              | [[http://fly.srk.fer.hr/~hniksic]]                                               |
| strfile                   | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| string-fns                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| suggbind                  | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| swadesh-numbers           | [[http://www.cb1.com/~john/computing/emacs/lisp/natural-language]]               |
| swbuff-advice             | [[http://www.northbound-train.com]]                                              |
| swimmers                  | [[http://www.cb1.com/~john/computing/emacs/lisp/games]]                          |
| swiss-move                | [[http://www.skamphausen.de/cgi-bin/ska/swiss-move]]                             |
| sww                       | [[http://www.xsteve.at/prg/emacs]]                                               |
| sysadmin                  | [[http://www.cb1.com/~john/computing/emacs/lisp/sysadmin]]                       |
| task-mode                 | [[http://racin.free.fr/old/projects.html#task-mode]]                             |
| taskjuggler-mode          | [[http://www.skamphausen.de/cgi-bin/ska/taskjuggler-mode]]                       |
| technorati                | [[http://edward.oconnor.cx/elisp]]                                               |
| tee                       | [[http://levana.de/emacs]]                                                       |
| texletter                 | [[http://www.skamphausen.de/cgi-bin/ska/Software]]                               |
| tiger                     | [[http://edward.oconnor.cx/elisp]]                                               |
| timestamp                 | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| tld                       | [[http://www.davep.org/emacs]]                                                   |
| tmenu                     | [[http://homepage1.nifty.com/bmonkey/emacs/index-en.html]]                       |
| tmmofl-x                  | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| todoo                     | [[http://www.mulix.org/code.html]]                                               |
| toggle-buffer             | [[http://www.northbound-train.com]]                                              |
| toggle-case               | [[http://www.northbound-train.com]]                                              |
| tokipona                  | [[http://edward.oconnor.cx/elisp]]                                               |
| total-numbers             | [[http://www.cb1.com/~john/computing/emacs/lisp/misc]]                           |
| tpum                      | [[http://lgarc.narod.ru/xemacs]]                                                 |
| track-scroll              | [[http://www.skamphausen.de/cgi-bin/ska/track-scroll]]                           |
| twiddle                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| twiki-outline             | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| u-appt                    | [[http://ulf.epplejasper.de/EmacsCalendarAndDiary.html]]                         |
| u-color-cycle             | [[http://ulf.epplejasper.de/EmacsFunStuff.html]]                                 |
| u-mandelbrot              | [[http://ulf.epplejasper.de/EmacsFunStuff.html]]                                 |
| uboat                     | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| unbind                    | [[http://www.davep.org/emacs]]                                                   |
| uniesc                    | [[http://www.loveshack.ukfsn.org/emacs]]                                         |
| unique                    | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| update-autoloads          | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| update-dns                | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| upside-down               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| variant                   | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| variant-abbc              | [[http://homepages.cs.ncl.ac.uk/phillip.lord/emacs.html]]                        |
| viewtex                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| vkill                     | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| vorbiscomment             | [[http://www.phys.au.dk/~harder]]                                                |
| warlord                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| watch-sexp                | [[http://www.skamphausen.de/cgi-bin/ska/Software]]                               |
| watson                    | [[http://emarsden.chez.com/downloads]]                                           |
| wb-line-number            | [[http://homepage1.nifty.com/blankspace/emacs/elisp.html]]                       |
| webinfo                   | [[http://www.davep.org/emacs]]                                                   |
| what-domain               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| who-calls                 | [[http://www.phys.au.dk/~harder]]                                                |
| win-disp-util             | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| windows                   | [[http://www.gentei.org/~yuuji/software]]                                        |
| with-file                 | [[http://www.cb1.com/~john/computing/emacs/lisp/file-handling]]                  |
| with-saved-messages       | [[http://www.cb1.com/~john/computing/emacs/lisp/elisp-dev-tools]]                |
| woof                      | [[http://www.xsteve.at/prg/emacs]]                                               |
| wordnik                   | [[http://edward.oconnor.cx/elisp]]                                               |
| words-in-elisp-symbols    | [[http://www.cb1.com/~john/computing/emacs/lisp/natural-language]]               |
| x-dict                    | [[http://www.xsteve.at/prg/emacs]]                                               |
| xml-event                 | [[http://edward.oconnor.cx/elisp]]                                               |
| xml-stream                | [[http://edward.oconnor.cx/elisp]]                                               |
| xrdb-mode                 | [[http://www.python.org/emacs]]                                                  |
| xterm-frobs               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| xterm-title               | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| xwindow-ring              | [[http://www.xsteve.at/prg/emacs]]                                               |
| yank-whitespace           | [[http://www.cb1.com/~john/computing/emacs/lisp/editing]]                        |
| yatex                     | [[http://www.yatex.org]]                                                         |
| youwill                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| yow-fns                   | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ysq                       | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |
| ysq-modeline              | [[http://www.splode.com/~friedman/software/emacs-lisp]]                          |

** table ~pkg-wikipages~
#+NAME: table--pkg-wikipages
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Wikipage")
    (epkg-sql [:select * :from pkg-wikipages :order-by [(asc page)]]))
#+END_SRC
#+RESULTS: table--pkg-wikipages
| Package             | Wikipage                             |
|---------------------+--------------------------------------|
| ajc-java-complete   | AutoJavaComplete                     |
| autolisp            | AutoLispMode                         |
| breadcrumb          | BreadcrumbForEmacs                   |
| buqis               | BufferQuickSwitcher                  |
| ca2                 | CaMode                               |
| cursor-chg          | ChangingCursorDynamically            |
| cssh                | ClusterSSH                           |
| coroutine           | CoRoutines                           |
| columnize           | ColumnizeWords                       |
| mwe-log-commands    | CommandLogMode                       |
| jcl-command-subset  | CommandSubset                        |
| corba               | CorbaImplementation                  |
| cua-lite            | CuaLightMode                         |
| cucumber-i18n       | CucumberI18nEl                       |
| deferred            | DeferredTask                         |
| move-and            | DeleteKillAndCopy                    |
| dired-filetype-face | DiredFileTypeFaces                   |
| ebs                 | EasyBufferSwitch                     |
| eform               | ElectricFormMode                     |
| el-expectations     | EmacsLispExpectations                |
| muse                | EmacsMuse                            |
| eoops               | EmacsObjectOrientedProgrammingSystem |
| erobot              | EmacsRobots                          |
| escreen             | EmacsScreen                          |
| etom                | EmacsToMaya                          |
| ewb                 | EmacsWebBrowser                      |
| ethan-wspace        | EthanWhitespace                      |
| member-functions    | ExpandMemberFunctions                |
| tag                 | FileTagUpdate                        |
| flymake-for-csharp  | FlymakeCsharp                        |
| gobject-class       | GObjectClassHelpers                  |
| google              | GoogleInterface                      |
| ipa                 | InPlaceAnnotations                   |
| inertial-scroll     | InertialScrolling                    |
| java-complete       | JavaCompletion                       |
| kdic                | KanjiDictionary                      |
| loops               | LoopFindPackage                      |
| osx-plist           | MacOSXPlist                          |
| magpie              | MagpieExpansion                      |
| mss                 | MakeSmartShortcuts                   |
| markerpen           | MarkerPens                           |
| mhc                 | MessageHarmonizedCalendaring         |
| mc                  | MidnightCommanderMode                |
| modeline-posn       | ModeLinePosition                     |
| mu                  | MushMode                             |
| mutt-alias          | MuttAliases                          |
| nc                  | NortonCommanderMode                  |
| window-number       | NumberedWindows                      |
| oauth               | OAuthLibrary                         |
| pcmpl-ssh           | PcompleteSSH                         |
| ps2pdf              | PostScriptToPDF                      |
| pushy               | PushyCompletion                      |
| tiling              | QuickTiling                          |
| rational            | RationalNumber                       |
| repdet              | RepetitionDetectionPackage           |
| ri                  | RiEl                                 |
| riece               | RieceIrcClient                       |
| fdlcap              | RotateWordCapitalization             |
| rvm                 | RvmEl                                |
| scrl-margs          | ScrollMargs                          |
| summarye            | SummaryEditMode                      |
| psvn                | SvnStatusMode                        |
| sys                 | SysPackage                           |
| technorati          | TechnoratiClient                     |
| teco                | TecoInterpreterInElisp               |
| thing-opt           | ThingAtPointOptional                 |
| nntodo              | TodoGnus                             |
| typing              | TypingOfEmacs                        |
| vbnet-mode          | VbDotNetMode                         |
| versions            | VersionsPackage                      |
| bm                  | VisibleBookmarks                     |
| workgroups          | WorkgroupsForWindows                 |
| xray                | XrayPackage                          |
| arrange-buffers     | rcircDisplayChannels                 |
| rcirc-groups        | rcircGroupMode                       |
| rfc                 | rfc-el                               |

** table ~raw-wikipages~
Not interesting.

